# Week 7 Assignment 7

Choose six recent popular movies. Ask at least five people that you know (friends, family, classmates, imaginary friends) to rate each of these movies that they have seen on a scale of 1 to 5. There should be at least one movie that not everyone has seen!

Take the results (observations) and store them somewhere (like a SQL database, or a .CSV file). Load the information into a pandas dataframe. Your solution should include Python and pandas code.

In [1]:
# import modules
import pandas as pd
import numpy as np

Importing the source csv file into pandas:

In [2]:
# inputted the source csv file with the Names column as the index
movies = pd.read_csv('Movies.csv', index_col=0)
movies

        Star Wars  Frozen  Joker  Addams Family  Terminator  Jurassic Park
Names
James         5.0     NaN    5.0              3         NaN            1.0
Laurel        1.0     3.0    NaN              4         NaN            2.0
Susan         NaN     NaN    3.0              2         5.0            4.0
Wally         4.0     NaN    NaN              4         NaN            NaN
Thomas        NaN     3.0    2.0              5         1.0            3.0

## Average ratings for each movie
Calculating the mean for each movie, rounding down to 2 digits:

In [3]:
movies.mean().round(decimals=2)

Star Wars        3.33
Frozen           3.00
Joker            3.33
Addams Family    3.60
Terminator       3.00
Jurassic Park    2.50
dtype: float64

Note that the formula is smart enough to account for blank values; empty cells are not counted.

## Average ratings for each user
Calculating the mean for each user, rounding down to 2 digits:

In [4]:
moviesmean = pd.Series(movies.mean(axis=1).round(decimals=2))
moviesmean

Names
James     3.5
Laurel    2.5
Susan     3.5
Wally     4.0
Thomas    2.8
dtype: float64

## Normalized ratings for each user
Taking the source data and creating a new table with normalized values
using the formula found here: https://bi-analytics.org/topic/9-standardization-vs-normalization/

In [5]:
normalized = (movies - movies.min()) / (movies.max() - movies.min())
normalized

        Star Wars  Frozen     Joker  Addams Family  Terminator  Jurassic Park
Names
James        1.00     NaN  1.000000       0.333333         NaN       0.000000
Laurel       0.00     NaN       NaN       0.666667         NaN       0.333333
Susan         NaN     NaN  0.333333       0.000000         1.0       1.000000
Wally        0.75     NaN       NaN       0.666667         NaN            NaN
Thomas        NaN     NaN  0.000000       1.000000         0.0       0.666667

### Creating user averages with the normalized data:

In [6]:
normalized_users = normalized.mean(axis=1).round(decimals=2)
normalized_users

Names
James     0.58
Laurel    0.33
Susan     0.58
Wally     0.71
Thomas    0.42
dtype: float64

### Movie averages with the normalized data:

In [7]:
normalized_movies = normalized.mean().round(decimals=2)
normalized_movies

Star Wars        0.58
Frozen            NaN
Joker            0.44
Addams Family    0.53
Terminator       0.50
Jurassic Park    0.50
dtype: float64

## Conclusion
Normalized data can be very useful as it reworks the data to all be on the same scale from zero to one, however in this case there was an issue -- there couldn't be normalized data for the movie Frozen, as the film only had two 3-star ratings, and when normalizing the data, the denominator subtracted the max value (3) from the min value (3), which meant that the denominator was zero. The formula would then error out as the computer could not divide by zero.